spec/fixtures/stripe_webhooks/customer.subscription.updated-trial-end.json

{
  "id": "evt_00000000000000",
  "object": "event",
  "type": "customer.subscription.updated",
  "created": 1540215500,
  "data": {
    "object": {
      "id": "su_00000000000000",
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "created": 1497881783,
            "plan": {
              "id": "fkx0AFo_00000000000000",
              "interval": "month",
              "name": "Member's Club",
              "amount": 100,
              "currency": "usd",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {
              }
            },
            "quantity": 1
          },
          {
            "id": "si_00000000000001",
            "object": "subscription_item",
            "created": 1497881788,
            "plan": {
              "id": "fkx0AFo_00000000000001",
              "interval": "month",
              "name": "Vistor's Club",
              "amount": 200,
              "currency": "eur",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {
              }
            },
            "quantity": 5
          }
        ]
      },
      "object": "subscription",
      "start": 1381080561,
      "status": "active",
      "customer": "cus_00000000000000",
      "cancel_at_period_end": false,
      "current_period_start": 1381080561,
      "current_period_end": 1383758961,
      "ended_at": null,
      "trial_start": null,
      "trial_end": null,
      "canceled_at": null,
      "quantity": 1,
      "application_fee_percent": null
    },
    "previous_attributes": {
      "current_period_start": 1378488561,
      "current_period_end": 1381076961,
      "status": "trialing"
    }
  }
}
